package homeworkIrina;

public class HW6 {
    //10.Написать метод, который принимает
    // на вход параметры start,  end, step, и печатает последовательность
    // десятичных  чисел, начиная с числа start, с шагом step.
    // Точка выхода из цикла - число end.
    public static void print10(double end, double start, double step){
        for ( double i = start; i < end; i += step){
            System.out.println(i + "-----10-----");
        }
    }

    //11.Написать метод, который принимает параметр  и печатает
    // последовательность четных чисел от нуля. Длина последовательности = l.
    public static void print0toL(int l) {
        int end = 0;
        for (int i = 0; end < l; i+=2) {
                    System.out.println(i + "----11-----");
                    end++;
                }
            }

//12/Напишите метод, который принимает целое число n, и выводит все степени числа 2 от 1 до n включительно
    public static void print12(int n) {
        int end = 0;
        for (int i = 2; end < n; i *= 2) {
            end++;
                System.out.println(i + "----12-----");
            }
        }


    //16.Написать метод, который принимает параметры n, m, , и печатает последовательность
    // нечетных чисел начиная с числа n, с шагом m,  длина последовательности  l.
    public static void print16(int n, int m, int l){
        int end1 = 0;
        for (int i = n; end1 < l;i += m){
            if(i % 2 != 0){
                System.out.println(i+ "----16-----");
                end1++;
            }
        }
    }

    //17.Сгенерируйте и распечатайте последовательность по формуле:
    //n + 1 = n + 2
    public static void print17(int n) {
        for (int i = n; ; i += 2) { //бесконечная
            System.out.println(i);
        }
    }

    //18.Написать метод, который принимает параметры l, n, и печатает последовательность чисел,
    // начиная с числа n, по формуле для n + 1 члена последовательности:
    //n + 1 = 2n
    //Длина последовательности l .


    public static void print18(int n, int l) {
        int end2 = 0;
        for (int i = n; end2 < l; i *= 2) {
            System.out.println(i);
            end2++;
        }
    }




    public static void main(String[] args) {
print12(5);
print18(3,4);
       print0toL(10);
        print16(6,9,8);
        print16(1, 3, 29);
    print10(7.9,1.0,2.0);
      //  print17(2);
        System.out.println("----");
        print18(1,8);
        //1.Распечатать последовательность чисел от 0 до 9 включительно.

        for (int i = 0; i < 10; i++) {
            System.out.println(i);
        }
        //2.Распечатать последовательность чисел от 10 исключительно до 0 включительно.
        for (int i = 9; i >= 0; i--) {
            System.out.println(i);
        }
        //3.Распечатать последовательность чисел от 50 до 55 включительно с шагом 2.
        for (int i = 50; i < 56; i += 2) {
            System.out.println(i);
        }
        //4.Распечатать последовательность чисел, кратных 7, в промежутке (327, 300)
        for (int i = 327; i >= 300; i--) {
            if (i % 7 == 0) {
                System.out.println(i);
            }
        }

        // 5.Распечатать последовательность чисел в промежутке [12, 13] с шагом 0.1
        for (double i = 12; i < 14; i += 0.1) {
            System.out.println( i);
        }
        //6.Распечатать последовательность четных чисел от 215 до 237 включительно
        for (int i = 215; i < 238; i++) {
            if (i % 2 == 0) {
                System.out.println(i);
            }
        }

        //7. Распечатать последовательность чисел,
        // кратных 7, в промежутке от 7 исключительно до 14 исключительно.
        int a = 0;
        for (int i = 8; i < 14; i++) {

            if (i % 7 == 0) {
                System.out.println(i);
                a = 1;
            }
        }
        if (a == 0) {
            System.out.println("Таких чисел нет");
        }
        //8.Распечатать последовательность которая начинается с минимального
        // значения типа данных short и заканчивается максимальным значением short.
        // Числа в последовательности должны быть кратны 15001.

        for (short i = Short.MIN_VALUE; i < Short.MAX_VALUE; i++) {
            if (i % 15001 == 0) {
                System.out.println(i);
            }
        }

        //9.Распечатать последовательность чисел в промежутке от -10 до 34 включительно.
        // Числа, кратные 11, должны быть распечатаны синим цветом.
        // Числа, кратные 12, должны быть распечатаны красным цветом.
        // А ноль необходимо распечатать словом ZERO.
        System.out.println("___________9_______________");
        for (int i = -10; i < 35; i++) {

            if (i % 11 == 0) {
                System.out.println("\u001B[34m" + i + "\u001B[0m");

            }
            if (i % 12 == 0) {
                System.out.println("\u001B[31m" + i + "\u001B[0m");
            }
            if (i == 0) {
                System.out.println("ZERO");
            }
        }


        //13.Вывести последовательность 012345678900112233445566778899000…
        // до числа 9999 включительно.
        for (int i = 0; i < 10; i++) {
            System.out.println(i);
        }
        for (int i = 0; i < 10; i++) {
            System.out.println("" + i + i);
        }
        for (int i = 0; i < 10; i++) {
            System.out.println("" + i + i + i);
        }
        for (int i = 0; i < 10; i++) {
            System.out.println("" + i + i + i + i);
        }
       // 14.Распечатайте последовательность чисел:
        //0, 1, -1, 2, -2, 3, -3, 4, -4, 5, -5
        for (int i = 0; i >= -5; i--){
            System.out.println(i * -1);
            System.out.println(i);
        }

        //15.Распечатать последовательность чисел: 0, 3, 5, 6, 9, 10, 12, 15, 18, 20, 21, 24, 25
        for (int i = 0; i < 26; i ++){
            if (i % 5 == 0 || i % 3 ==0){
                System.out.println(i);
            }
        }


        //19/Сгенерируйте последовательность целых положительных  двузначных чисел, в которых разница
        // между первой цифрой (десятки) и второй цифрой (единицы) не превышает 3.
        //20
        for (int i = 10;i < 100; i ++){
            if(Math.abs((i / 10) - (i % 10)) <= 3){ //нахождение единиц и десятков
                System.out.println(i + "********");
            }
        }















    }
}


//







